Extensions installed on WSL: Ubuntu:
batisteo.vscode-django@1.15.0
bhdesign.supabase-dataobject-helper@1.0.2
bradlc.vscode-tailwindcss@0.14.29
dbaeumer.vscode-eslint@3.0.16
donjayamanne.githistory@0.6.20
eamodio.gitlens@17.6.2
editorconfig.editorconfig@0.17.4
esbenp.prettier-vscode@11.0.0
github.copilot-chat@0.32.4
github.copilot@1.388.0
github.vscode-github-actions@0.28.0
github.vscode-pull-request-github@0.120.2
google.gemini-cli-vscode-ide-companion@0.7.0
google.geminicodeassist@2.57.0
googlecloudtools.cloudcode@2.37.0
ms-azuretools.azure-dev@0.10.0
ms-azuretools.vscode-azure-github-copilot@1.0.137
ms-azuretools.vscode-azure-mcp-server@1.0.0
ms-azuretools.vscode-azureappservice@0.26.4
ms-azuretools.vscode-azurecontainerapps@0.9.1
ms-azuretools.vscode-azureresourcegroups@0.11.6
ms-azuretools.vscode-containers@2.2.0
ms-azuretools.vscode-cosmosdb@0.28.2
ms-azuretools.vscode-docker@2.0.0
ms-mssql.data-workspace-vscode@0.6.3
ms-playwright.playwright@1.1.16
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.3.0
ms-toolsai.jupyter@2025.9.1
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode.vscode-typescript-next@6.0.20251109
ms-windows-ai-studio.windows-ai-studio@0.24.1
njpwerner.autodocstring@0.6.1
openai.chatgpt@0.4.38
prisma.prisma@6.19.0
streetsidesoftware.code-spell-checker@4.2.6
supabase.vscode-supabase-extension@0.0.11
teamsdevapp.vscode-ai-foundry@0.10.6
toba.vsfire@1.4.1
